In [1]:
import pandas as pd
import numpy as np

In [2]:
nairobi_rentals = pd.read_csv(r"C:\Users\User\Desktop\MYPROJECTS\Nairobi Rentals\data\rentals.csv")
nairobi_rentals.head()

                    location  bedrooms  bathrooms    rent
0  Kilimani, Dagoretti North         3          3   90000
1        Upper Hill, Langata         3          2  360000
2      Road, Dagoretti North         2          2  105000
3       Parklands, Westlands         2          3  120000
4  Kilimani, Dagoretti North         3          6  100000

In [3]:
nairobi_rentals.drop('bathrooms', axis=1, inplace=True)

In [4]:
nairobi_rentals.head()

                    location  bedrooms    rent
0  Kilimani, Dagoretti North         3   90000
1        Upper Hill, Langata         3  360000
2      Road, Dagoretti North         2  105000
3       Parklands, Westlands         2  120000
4  Kilimani, Dagoretti North         3  100000

In [5]:
rentals = nairobi_rentals.groupby(by=['location', 'bedrooms'], as_index=False)['rent'].mean().round()

In [47]:
rentals.head()

      location  bedrooms      rent
0    Ridgeways         2  198333.0
1    Ridgeways         3  217727.0
2    Ridgeways         4   86000.0
3    Ridgeways         5  112500.0
4    Ridgeways         6  400000.0